In [41]:
import pandas as pd

In [45]:
df_test = pd.DataFrame({'col_1': ['34', 'abc123', '23'],
                        'col_2': ['23', 'abc3', 'abc6'], 
                        'col_3': ['abc', 'a23', '123456'], 
                        'col_4': ['abc', 'ab', 'a456'], 
                        'col_5': ['abc1234', '23', 'c456']})
test_cols= ["col_1", "col_2", "col_3", "col_4", "col_5"]
df_test

    col_1 col_2   col_3 col_4    col_5
0      34    23     abc   abc  abc1234
1  abc123  abc3     a23    ab       23
2      23  abc6  123456  a456     c456

In [46]:
for col in test_cols:
    df_test[col] = df_test[col].replace({'23':'HERE'})
df_test

    col_1 col_2   col_3 col_4    col_5
0      34  HERE     abc   abc  abc1234
1  abc123  abc3     a23    ab     HERE
2    HERE  abc6  123456  a456     c456

In [47]:
for col in test_cols:
    df_test[col] = df_test[col].str.replace('23','HERE')
df_test

      col_1 col_2     col_3 col_4      col_5
0        34  HERE       abc   abc  abc1HERE4
1  abc1HERE  abc3     aHERE    ab       HERE
2      HERE  abc6  1HERE456  a456       c456